<%@page import="com.huacainfo.ace.common.tools.CommonUtils"%>
<%@ page language="java" contentType="text/html; charset=utf-8"
	pageEncoding="utf-8"%>
<!DOCTYPE html>
<html lang="cn">
<head>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta charset="utf-8" />
<meta name="viewport"
	content="width=device-width, initial-scale=1.0, maximum-scale=1.0" />
<title>memberCenter</title>
</head>
<jsp:include page="../../../common/common.jsp" />
<style>
        disableds{
            pointer-events: none;
            filter: alpha(opacity=50); /*IE滤镜，透明度50%*/
            -moz-opacity: 0.5; /*Firefox私有，透明度50%*/
            opacity: 0.5; /*其他，透明度50%*/
        }
</style>
<script type="text/javascript">var depatId="";</script>
<body>
	<div class="page-content">
		<div class="col-xs-12 col-sm-12">
			<h2 align="center">深圳市公路货运行业协会章程</h2>
第一章   总  则</p>

第一条  本会的中文称为深圳市公路货运协会(以下简称本会)， 英文名称为SHENZHEN ROAD FREIGHT ASSOCIATION</p>
第二条  本会是由我市各公路货运企业自愿组成的行业性民间组织，属地方非营利性社会团体，是依法成立的具有法人资格的社团组织。　</p>　
第三条  本团体的宗旨：本协会坚决拥护中国共产党的领导，坚持党的基本路线，遵守宪法、法律、法规和国家政策，遵守社会道德风尚；积极主动协助业务主管单位进行行业协调管理工作；反映企事业单位的要求与呼声、维护其合法权益；加强与国内外同行业的联系与交流，组织专业培训，促进深圳公路货运业繁荣发展，推进深圳公路货运行业标准化、正规化，增强深圳公路货运企业核心竞争力、服务深圳公路货运企业。繁荣与发展我市公路货运事业，促进社会主义物质文明和精神文明建设。</p>　　
第四条  本会接受社团登记管理机关的监督管理和广东省深圳市行业协会服务署和社团登记管理机关，深圳市民政局的业务指导。　</p>
第五条  本会的活动地域为广东省深圳市。</p>
第六条  本会的住所广东省深圳市。</p></p>

第二章  业务范围</p>
第七条  本协会的业务范围为行业调研、人才培训、咨询服务、会展招商，举办论坛，编辑刊物，推荐名优品牌，信息技术交流等（涉及行政许可证，凭许可证开展业务）。</p>
（一）贯彻国家和市政府关于发展公路货运业的各项方针、政策和法规，向政府有关部门反映涉及产业利益的事项和企业的正当愿望及合理要求，维护企业合法权益。对政府正在制订的和现行的公路货运运输政策、管理法规、行业发展规划、运力调控等提出意见和建议。</p>
（二）参与有关公路货运业发展改革以及与公路货运业利益相关的政府决策论证，研究公路货运产业发展中出现的问题，向政府提出有关产业政策、经济立法方面的意见和建议，协助政府加强行业管理。</p>
（三）组织和举办现代公路货运业经济理论与实务研究、学术研究和交流，促进现代公路货运业经济理论水平的提高。</p>
（四）开展行业自律管理，制定行规行约、恪守诚信原则，对违反行规行约，损害行业整体形象的会员，采取相应的行业自律措施；制定行业质量规范、服务标准；参与行业职业技能鉴定，不断提高行业素质和职业道德水准。</p>
（五）制订行业内争议处理的规则和程序，对会员之间、会员与非会员之间或者会员与消费者之间就行业经营活动产生的争议事项进行协调。也可对本会与其它行业协会或者其他组织的相关经营事宜进行协调，以及代表本行业参与行业性集体谈判，提出涉及行业利益的意见和建议。</p>
（六）经常了解听取公路货运运输企业的呼声，协助政府解决他们关心的问题，加强企业与企业之间的联系，定期召开信息交流会，组织编印深圳市公路货运协会通讯及会刊；</p>
（七）接受政府委托，开展公路货运行业统计、调查、发布行业信息、公证证明、价格协调、行业准入资格资质审核，以及行业评估论证、职称认证，行业发展规划和有关技术标准的制订和评审等工作。</p>
（八）据会员需求组织开展专业培训、职称认证、技术咨询、法律援助、信息交流、会展招商以及推介行业产品和服务品牌等服务活动。</p>
（九）组织开展与国内外有关经济组织和公路货运团体的交流活动，积极吸纳国内外先进的公路货运技术和管理经验，促进与国内外公路货运行业的交流合作，提供国内外市场的商机。</p>
（十）开展市场调查，分析市场形势，开发信息资源，建立信息网络、编辑行业会刊、年鉴、资料和专业书藉，为会员提供服务。</p>
（十一）推进本行业的企业改革与产业发展，表彰先进、交流经验，组织会员开展各种形式的活动，提高企业的文化建设和现代化管理水平。</p>
（十二）组织发展行业的公益事业，参与和开展有益于提高本行业社会地位的各种社会活动。</p>
（十三）承担法律法规授权、政府委托及章程规定的其它职能。</p></p>

第三章   会 员</p>
第八条  深圳市的公路货运枢纽（货运场站和货运市场）；城际公路快运的企业；全国干线运输与配载的企业；特种公路货物运输的企业；为公路货运提供产品或服务等相关行业的企业、机构、单位及驻深的外资企业。</p>
第九条  申请加入本会的会员，必须具备下列条件：</p>
　　（一）拥护本会的章程；</p>
　　（二）有加入本会的意愿；</p>
　　（三）在本行业领域内诚信经营的企业；</p>
          （四）应持有工商营业执照等相关证件。</p>
第十条  会员入会的程序是：</p>
　　（一）提交入会申请书；</p>
　　（二）经理事会讨论通过；</p>
　　（三）由理事会或理事会授权的机构（秘书处）发给会员证。</p>
第十一条  会员享有下列权利：</p>
　　（一）出席会员大会（或会员代表大会），参加协会活动、接受协会提供的服务；</p>
　　（二）选举权、被选举权和表决权；</p>
　　（三）获得本会服务的优先权；</p>
　　（四）对本会工作的提议案权、建议权和监督权；</p>
　　（五）入会自愿、退会自由；</p>
　　（六）免费获得本会刊物，获得本会为会员单位提供的其他出版物或信息资料；</p>
第十二条  会员履行下列义务：　</p>
          （一）遵守本会章程；</p>
          （二）执行本会的决议；</p>
          （三）按规定交纳会费；</p>
          （四）维护本会及本行业的合法权益；</p>
　　 （五）完成本会交办的工作；</p>
　　 （六）向本会反映情况，提供有关资料；</p>
第十三条  会员缴纳会费的标准：</p>
         （一）普通会员2000元/年（首年免费）</p>
         （二）理事单位元5000元/年</p>

			<div class="space-12"></div>
			<span><input type="radio" name="a" id="regula_invitation" onClick="javascript:getCheck();"/>我已阅读了解《协会章程》内容，认可《协会章程》，明白会员的权利和义务 </span>
		</div>
		<div class="space-12"></div>
		<div id="index_regu" align="center">
			<a class="btn btn-info disableds" id="btn_next" authority="false" enabled="true" style="width:90px;font-size:16px;">返回</a>
		</div>
	</div>

	<jsp:include page="../../../common/footer-1.jsp" />
	<script
		src="${pageContext.request.contextPath}/content/service/companyUserCenter/controller.js?version=${cfg.version}"></script>
	<jsp:include page="../../../common/footer-2.jsp" />
	<script type="text/javascript">
		window.onresize = function() {
			autoSize();
		}
		parent.onresize = function() {
			autoSize();
		}
		function autoSize() {
			parent.autoWidth();
		}
		function getCheck(){
			$('#btn_next').attr('href', '../00010001/invitation.jsp');
		}
	</script>
</body>
</html>