var data = {
	"data4" : [ [ {
		"name" : "清镇市",
		"value" : 10573
	}, {
		"name" : "六枝特区"
	} ], [ {
		"name" : "钟山区",
		"value" : 10228
	}, {
		"name" : "六枝特区"
	} ], [ {
		"name" : "六枝特区",
		"value" : 9519
	}, {
		"name" : "水城县"
	} ], [ {
		"name" : "水城县",
		"value" : 9496
	}, {
		"name" : "水城县"
	} ], [ {
		"name" : "盘县",
		"value" : 10409
	}, {
		"name" : "六枝特区"
	} ] ],
	"data3" : {
		"钟山区" : [ "104.8590732", "26.5845359" ],
		"水城县" : [ "104.9579501", "26.5480133" ],
		"六枝特区" : [ "105.480026", "26.2012303" ],
		"盘县" : [ "104.4682646", "25.7038767" ],
		"清镇市" : [ "106.3369703", "26.679722" ]
	},
	"data2" : [ {
		"name" : "清镇市",
		"value" : 881
	}, {
		"name" : "钟山区",
		"value" : 1627
	}, {
		"name" : "六枝特区",
		"value" : 1512
	}, {
		"name" : "水城县",
		"value" : 734
	}, {
		"name" : "盘县",
		"value" : 796
	} ],
	"data1" : [ {
		"name" : "清镇市",
		"value" : 338017
	}, {
		"name" : "钟山区",
		"value" : 221636
	}, {
		"name" : "六枝特区",
		"value" : 329081
	}, {
		"name" : "水城县",
		"value" : 262764
	}, {
		"name" : "盘县",
		"value" : 189330
	} ]
};